### 📖 Terraform Plan (infra-pe/resources/uat) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.dns_weu.azurerm_private_dns_zone.private_dns_zones["pep_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "cgnonboardingportal-u-vnet-rg"
      + tags                                                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }

      + soa_record (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.private_dns_links["pep_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "cgnonboardingportal-u-vnet"
      + private_dns_zone_name = "privatelink.azure-api.net"
      + registration_enabled  = false
      + resolution_policy     = (known after apply)
      + resource_group_name   = "cgnonboardingportal-u-vnet-rg"
      + tags                  = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Uat"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
      + virtual_network_id    = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/cgnonboardingportal-u-vnet-rg/providers/Microsoft.Network/virtualNetworks/cgnonboardingportal-u-vnet"
    }

  # module.cgn_pe_apim.module.apim.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.ApiManagement/service/io-u-itn-cgn-pe-apim-01"
      + min_api_version               = "2021-08-01"
        name                          = "io-u-itn-cgn-pe-apim-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_network_security_group.nsg_apim will be updated in-place
  ~ resource "azurerm_network_security_group" "nsg_apim" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/networkSecurityGroups/io-u-itn-cgn-pe-apim-nsg-01"
        name                = "io-u-itn-cgn-pe-apim-nsg-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (3 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/management.azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be updated in-place
  ~ resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
        id                  = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateDnsZones/scm.azure-api.net/A/io-u-itn-cgn-pe-apim-01"
        name                = "io-u-itn-cgn-pe-apim-01"
      ~ tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (5 unchanged attributes hidden)
    }

  # module.cgn_pe_apim.module.apim.azurerm_private_endpoint.apim_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "apim_pep" {
        id                            = "/subscriptions/d1a90d9f-6ee1-4fb2-a149-7aedbf3ed49d/resourceGroups/io-u-itn-cgn-pe-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-cgn-pe-apim-pep-01"
        name                          = "io-u-itn-cgn-pe-apim-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Uat"
            "ManagementTeam" = "IO CGN"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.0.0" -> "2.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/uat"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 0 to destroy.
```

</details>
